<a href="https://colab.research.google.com/github/Syed8558/SQL/blob/main/SQL_SET_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
ðŸ”¹ Row-Level (Single-Row) Function Questions â€“ Based on Employees Schema

In [ ]:
1.Write a SQL query to display employee first and last names in uppercase.

In [ ]:
SELECT
    UPPER(first_name) AS FIRST_NAME,
    UPPER(last_name)  AS LAST_NAME
FROM employees;

In [ ]:
2.Write a query to extract the year from the `hire_date` of each employee.

In [ ]:
SELECT
    emp_no,
    EXTRACT(YEAR FROM hire_date) AS hire_year
FROM employees;

In [ ]:
3. Write a query to display employee full name by concatenating `first_name` and `last_name`.

In [ ]:
SELECT
    first_name  as FIRST_NAME
    last_name as LAST_NAME
    FIRST_NAME||' '||LAST_NAME as FULL_NAME
FROM employees;

In [ ]:
4.Write a query to find the length of each employeeâ€™s first name.

In [ ]:
SELECT
    first_name || ' ' || last_name AS full_name,
    LENGTH(first_name || ' ' || last_name) AS full_name_length
FROM employees;

In [ ]:
5. Write a query to replace the letter 'a' with 'A' in employee last names.

In [ ]:
SELECT
    last_name,
    REPLACE(last_name, 'a', 'A') AS updated_last_name
FROM employees;

In [ ]:
6. Write a query to display employee age using `birth_date`.

In [ ]:
SELECT
    emp_no,
    first_name,
    last_name,
    TRUNC(MONTHS_BETWEEN(SYSDATE, birth_date) / 12) AS age
FROM employees;

In [ ]:
7. Write a query to round employee salaries to the nearest thousand.

In [ ]:
SELECT
    emp_no,
    salary,
    ROUND(salary, -3) AS rounded_salary
FROM salaries;

In [ ]:
8. Write a query to display the month name of employee hire dates.

In [ ]:
SELECT
    emp_no,
    hire_date,
    TO_CHAR(hire_date, 'Month') AS hire_month
FROM employees;

In [ ]:
9. Write a query to handle NULL `to_date` values in salary records using `COALESCE`.

In [ ]:
SELECT
    emp_no,
    salary,
    from_date,
    COALESCE(to_date, CURRENT_DATE) AS to_date_handled
FROM salaries;

In [ ]:
10. Write a query to return NULL when `from_date` and `to_date` are the same using `NULLIF`.

In [ ]:
SELECT
    emp_no,
    salary,
    from_date,
    to_date,
    NULLIF(from_date, to_date) AS date_check
FROM salaries;

In [ ]:
ðŸ”¹ Subquery-Based SQL Questions â€“ Based on Employees Schema

In [ ]:
11.Write a SQL query to find employees earning more than the average salary.

In [ ]:
SELECT
    e.emp_no,
    e.first_name,
    e.last_name,
    s.salary
FROM employees e
JOIN salaries s
  ON e.emp_no = s.emp_no
WHERE s.salary > (
    SELECT AVG(salary)
    FROM salaries
);

In [ ]:
12.Write a query to list employees who are currently working in the 'Sales' department.

In [ ]:
SELECT
    e.emp_no,
    e.first_name,
    e.last_name
FROM employees e
JOIN dept_emp de
    ON e.emp_no = de.emp_no
JOIN departments d
    ON de.dept_no = d.dept_no
WHERE d.dept_name = 'Sales'
  AND de.to_date IS NULL;

In [ ]:
13.Write a query to find employees who have never been managers.

In [ ]:
SELECT
    e.emp_no,
    e.first_name,
    e.last_name
FROM employees e
WHERE NOT EXISTS (
    SELECT 1
    FROM dept_manager dm
    WHERE dm.emp_no = e.emp_no
);

In [ ]:
14.Write a query to display employees whose salary is greater than their departmentâ€™s average salary.

In [ ]:
SELECT e.emp_no, e.first_name, e.last_name
FROM employees e
WHERE e.emp_no IN (
    SELECT s.emp_no
    FROM salaries s
    JOIN dept_emp de ON s.emp_no = de.emp_no
    WHERE s.to_date = '9999-01-01'
      AND de.to_date = '9999-01-01'
      AND s.salary > (
          SELECT AVG(s2.salary)
          FROM salaries s2
          JOIN dept_emp de2 ON s2.emp_no = de2.emp_no
          WHERE de2.dept_no = de.dept_no
            AND s2.to_date = '9999-01-01'
            AND de2.to_date = '9999-01-01'
      )
);

In [ ]:
15.Write a query to find the employee(s) with the maximum salary.

In [ ]:
SELECT e.emp_no, e.first_name, e.last_name
FROM employees e
WHERE e.emp_no IN (
    SELECT emp_no
    FROM salaries
    WHERE salary = (SELECT MAX(salary) FROM salaries)
);

In [ ]:
16.Write a query to list departments that have more than one manager.

In [ ]:
SELECT dept_no
FROM dept_manager
GROUP BY dept_no
HAVING COUNT(emp_no) > 1;

In [ ]:
17.Write a query to find employees who have changed departments at least once.

In [ ]:
SELECT emp_no
FROM dept_emp
GROUP BY emp_no
HAVING COUNT(DISTINCT dept_no) > 1;

In [ ]:
18. Write a query to list employees whose current title is 'Senior Engineer'.

In [ ]:
SELECT e.emp_no, e.first_name, e.last_name
FROM employees e
WHERE e.emp_no IN (
    SELECT emp_no
    FROM titles
    WHERE title = 'Senior Engineer'
      AND to_date = '9999-01-01'
);

In [ ]:
19. Write a query to find employees who do not have any salary records.

In [ ]:
SELECT emp_no, first_name, last_name
FROM employees
WHERE emp_no NOT IN (
    SELECT emp_no FROM salaries
);

In [ ]:
20. Write a query to display employees hired earlier than their managers.

In [ ]:
SELECT e.emp_no, e.first_name, e.last_name
FROM employees e
JOIN dept_emp de ON e.emp_no = de.emp_no
JOIN dept_manager dm ON de.dept_no = dm.dept_no
JOIN employees m ON dm.emp_no = m.emp_no
WHERE de.to_date = '9999-01-01'
  AND dm.to_date = '9999-01-01'
  AND e.hire_date < m.hire_date;

In [ ]:
21. Write a query to find the current manager of each department.

In [ ]:
SELECT d.dept_no,
       d.dept_name,
       e.emp_no,
       e.first_name,
       e.last_name
FROM departments d
JOIN dept_manager dm ON d.dept_no = dm.dept_no
JOIN employees e ON dm.emp_no = e.emp_no
WHERE dm.to_date = '9999-01-01';

In [ ]:
22. Write a query to display the current salary of each employee.

In [ ]:
SELECT e.emp_no,
       e.first_name,
       e.last_name,
       s.salary
FROM employees e
JOIN salaries s ON e.emp_no = s.emp_no
WHERE s.to_date = '9999-01-01';

In [ ]:
23. Write a query to find the top 5 highest-paid employees.

In [ ]:
SELECT e.emp_no,
       e.first_name,
       e.last_name,
       s.salary
FROM employees e
JOIN salaries s ON e.emp_no = s.emp_no
WHERE s.to_date = '9999-01-01'
ORDER BY s.salary DESC
FETCH FIRST 5 ROWS ONLY;

In [ ]:
24. Write a query to calculate average salary per department.

In [ ]:
SELECT d.dept_name,
       AVG(s.salary) AS avg_salary
FROM departments d
JOIN dept_emp de ON d.dept_no = de.dept_no
JOIN salaries s ON de.emp_no = s.emp_no
WHERE de.to_date = '9999-01-01'
  AND s.to_date = '9999-01-01'
GROUP BY d.dept_name;

In [ ]:
25. Write a query to find employees who worked in more than one department.

In [ ]:
SELECT emp_no
FROM dept_emp
GROUP BY emp_no
HAVING COUNT(DISTINCT dept_no) > 1;

In [ ]:
26. Write a query to display employees with the longest tenure.

In [ ]:
SELECT emp_no,
       first_name,
       last_name,
       hire_date
FROM employees
WHERE hire_date = (
    SELECT MIN(hire_date) FROM employees
);

In [ ]:
27. Write a query to find departments with no employees.

In [ ]:
SELECT d.dept_no,
       d.dept_name
FROM departments d
WHERE d.dept_no NOT IN (
    SELECT dept_no
    FROM dept_emp
    WHERE to_date = '9999-01-01'
);

In [ ]:
28. Write a query to display salary history for a given employee.

In [ ]:
SELECT salary,
       from_date,
       to_date
FROM salaries
WHERE emp_no = 10001
ORDER BY from_date;

In [ ]:
29. Write a query to find employees whose job title has never changed.

In [ ]:
SELECT emp_no
FROM titles
GROUP BY emp_no
HAVING COUNT(DISTINCT title) = 1;

In [ ]:
30. Write a query to list managers who manage more than 5 employees.

In [ ]:
SELECT dm.emp_no,
       COUNT(de.emp_no) AS employee_count
FROM dept_manager dm
JOIN dept_emp de ON dm.dept_no = de.dept_no
WHERE dm.to_date = '9999-01-01'
  AND de.to_date = '9999-01-01'
GROUP BY dm.emp_no
HAVING COUNT(de.emp_no) > 5;